#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
Создать абстрактный базовый класс Body (тело) с абстрактными функциями вычисления
площади поверхности и объема. Создать производные классы: Parallelepiped
(параллелепипед) и Ball (шар) со своими функциями площади поверхности и объема.
"""


class Body:

    def surface_area(self):
        print("")


class Parallelepiped(Body):

    def volume(self):
        print("")
